'''
Библиотека
Создай класс Library для управления библиотекой.
Это задание закрепит работу со списками словарей + логику поиска.

Требования:
1) __init__ принимает:
	-name (название библиотеки)
	-books (список книг по умолчанию пустой [])

2) Каждая книга — словарь: {"title": "Война и мир", "author": "Толстой", 				"is_available": True}

3) Метод add_book(title, author):
	-Добавляет книгу если её нет
	-Если книга уже есть: "Книга '{title}' уже в библиотеке!"

4) Метод borrow_book(title):

	-Если книга есть И доступна: меняет is_available = False, выводит "Книга 					'{title}' выдана"
	- Если нет: "Книги '{title}' нет в наличии"

5) Метод return_book(title):
	- Если книга есть И выдана: меняет is_available = True, выводит "Книга 		'{title}' возвращена"
	- Иначе: "Книги '{title}' нет или уже возвращена"

6) Метод show_books():
	📚 Книги в библиотеке "Центральная":
	1. "Война и мир" (Толстой) - ✅ В наличии
	2. "1984" (Оруэлл) - ❌ Выдана
	Всего книг: 2 (1 доступна)

7)Метод available_books():
	-Возвращает количество доступных книг

Тестовый код:
library = Library("Центральная")
library.add_book("Война и мир", "Толстой")
library.add_book("1984", "Оруэлл")
library.add_book("Война и мир", "Пушкин")  # Уже есть!

library.show_books()

library.borrow_book("Война и мир")
library.borrow_book("Гарри Поттер")  # Нет такой
print(f"Доступно книг: {library.available_books()}")

library.return_book("Война и мир")
library.show_books()

Ожидаемый вывод:
Книга 'Война и мир' уже в библиотеке!

📚 Книги в библиотеке "Центральная":
1. "Война и мир" (Толстой) - ✅ В наличии
2. "1984" (Оруэлл) - ✅ В наличии
Всего книг: 2 (2 доступна)

Книга 'Война и мир' выдана
Книги 'Гарри Поттер' нет в наличии
Доступно книг: 1

Книга 'Война и мир' возвращена
📚 Книги в библиотеке "Центральная":
1. "Война и мир" (Толстой) - ✅ В наличии
2. "1984" (Оруэлл) - ✅ В наличии
Всего книг: 2 (2 доступна)

Подсказки:
# Поиск книги:
for book in self.books:
    if book["title"] == title:
        # Найдена!

# Счетчики:
available_count = sum(1 for book in self.books if book["is_available"])
'''

class Library:
    def __init__(self, name):
        self.name = name
        self.books = [] # пустой список
        
    def add_book(self, title, author):
        for x in self.books:
            if title.lower() in x['title'].lower():  # .lower()- для сравнения без учёта регистра
                print(f'Книга "{title}" уже в библиотеке!')
                return
        new_book = {'title': title, 'author': author, 'is_available': True}
        self.books.append(new_book)
        
    def borrow_book(self, title):
        for x in self.books:
            if title.lower() in x['title'].lower() and x['is_available'] == True:
                x['is_available'] = False
                print(f'Книга "{title}" выдана')
                return
        print(f'Книги "{title}" нет в наличии')
        
    def return_book(self, title):
        for x in self.books:
        	if title.lower() in x['title'].lower() and x['is_available'] == False:
                  x['is_available'] = True
                  print(f'Книга "{title}" возвращена')
                  return
        print(f'Книги "{title}" нет или уже возвращена')    
                                       
    def show_books(self):
        y = 0
        z = 0
        print(f'📚 Книги в библиотеке "{self.name}":')
        for x in self.books:
            y += 1
            if x['is_available'] == True:
                z += 1
                print(f'{y}. "{x['title']} " ({x['author']}) - ✅ В наличии')
            else:
                print(f'{y}. "{x['title']} " ({x['author']}) - ❌ Выдана')
        print(f'Всего книг: {y} ({z} доступна)')
        
    def available_books(self):
        z = 0
        for x in self.books:
            if x['is_available'] == True:
                z += 1   
        return z

library = Library("Центральная")
library.add_book("Война и мир", "Толстой")
library.add_book("1984", "Оруэлл")
library.add_book("Война и мир", "Пушкин")  # Уже есть!
print('')
library.show_books()
print('')
library.borrow_book("Война и мир")
library.borrow_book("Гарри Поттер")  # Нет такой
print(f"Доступно книг: {library.available_books()}")
print('')
library.return_book("Война и мир")
library.show_books()

print('**********************')
library_2 = Library("Главная")
library_2.add_book("Маленький принц", "Антуан де Сент-Экзюпери")
library_2.add_book("Приключения Тома Сойера", "Марк Твен")
library_2.add_book("Остров сокровищ", "Роберт Льюис Стивенсон")
print('')
library_2.show_books()
print('')
library_2.borrow_book("Война и мир") # Нет такой
library_2.borrow_book("Гарри Поттер")  # Нет такой
library_2.borrow_book("Приключения Тома Сойера")
library_2.borrow_book("Остров сокровищ")
print(f"Доступно книг: {library_2.available_books()}")
print('')
library_2.return_book("Война и мир")
library_2.show_books()